Update architecture diagrams in README
